# ПЗ 1 на 75 балів
# Рівень 1 
# Отримуємо ім'я від користувача
name = input("Введіть ваше ім'я: ")

# Виводимо привітання
print(f"Привіт, {name}.")

# Рівень 2
# Отримуємо число від користувача
number = int(input("Введіть ціле число для перевірки: "))

# Просте число має бути більше за 1
if number > 1:
    is_prime = True
    
    # Оптимізація: перевіряємо дільники лише до квадратного кореня числа
    for i in range(2, int(number**0.5) + 1):
        if number % i == 0:
            is_prime = False
            break  # Якщо знайшли дільник, зупиняємо цикл
            
    # Виводимо результат
    if is_prime:
        print(f"{number} це просте число!")
    else:
        print(f"{number} не є простим числом, оскільки має інші дільники.")
else:
    print(f"{number} не є простим числом.")